In [1]:
import pandas as pd

In [2]:
india_weather=pd.DataFrame({
     "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Concat

## Row wise Concat

In [4]:
df=pd.concat((india_weather,us_weather))
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
## reset the index value
df=pd.concat((india_weather,us_weather),ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [6]:
## Making Key
df=pd.concat((india_weather,us_weather),keys=["India","US"])
df

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [7]:
df.loc["India"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [8]:
df.loc["US"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## Columns Wise Concat

In [13]:
temp_df=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30]
},index=[0,1,2])
temp_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [15]:
wind_df=pd.DataFrame({
    "city":["delhi","mumbai"],
    "windspeed":[7,12]
},index=[1,0])
wind_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [17]:
pd.concat((temp_df,wind_df),axis=1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

# Merging

In [18]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [19]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [22]:
df3=pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [23]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [24]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [26]:
df3=pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

## inner joined/ Merging

In [30]:
## return that part which is same in both
df3=pd.merge(df1,df2,on="city",how="inner")         
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

## Outer Join/Merging

In [33]:
## return that all
df3=pd.merge(df1,df2,on="city",how="outer")         
df3

        city  temperature  humidity
0  baltimore         38.0       NaN
1    chicago         14.0      65.0
2   new york         21.0      68.0
3    orlando         35.0       NaN
4  san diego          NaN      71.0

## Left merge/join

In [34]:
##get all data of left part and also get same data of both
df3=pd.merge(df1,df2,on="city",how="left")         
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

## Right Merge/Join

In [35]:
##get all data of Right part and also get same data of both
df3=pd.merge(df1,df2,on="city",how="right")         
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71